{
    "id": 8,
    "title": "Dua before exams",
    "subtitle": null,
    "audio": null,
    "verses": [
        {
            "id": 1,
            "text": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي",
            "translation": "Oh Allah! Make useful for me what You have taught me and teach me knowledge that will be useful to me.",
            "transliteration": "ALLAHUMMA INFA'NII BIMAA 'ALLAMTANII WA'ALLIMNII MAA YANFA'UUNII",
            "audio": null
        },
        {
            "id": 2,
            "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فَهْمَ النَّبِيِّينَ وَحِفْظَ الْمُرْسَلِينَ وَالْمُقَرَّبِينَ",
            "translation": "Oh Allah! I ask You for the understanding of the prophets and the memory of the messengers, and those nearest to You.",
            "transliteration": "ALLAHUMMA INII AS'ALUKA FAHMAL-NABIYYEN WA HIFTHAL MURSALEEN AL-MUQARRABEEN",
            "audio": null
        },
        {
            "id": 3,
            "text": "اللَّهُمَّ اجْعَلْ لِسَانِي عَامِرًا بِذِكْرِكَ وَقَلْبِي بِخَشْيَتِكَ",
            "translation": "Oh Allah! Make my tongue full of Your remembrance and my heart with consciousness of You.",
            "transliteration": "ALLAHUMMA IJ'AL LISANEE 'AMIRAN BI DHIKRIKA WA QALBI BI KHASHYATIKA",
            "audio": null
        },
        {
            "id": 4,
            "text": "إِنَّكَ عَلَىٰ مَا تَشَاءُ قَدِيرٌ وَأَنْتَ حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
            "translation": "Oh Allah! You do whatever You wish, and You are my Availer and Protector and the best of aid.",
            "transliteration": "INNAKA 'ALA MA-TASHA'U QADEER WA ANTA HASBUNA-ALLAHU WA NI'MAL WAKEEL",
            "audio": null
        },
        {
            "id": 5,
            "text": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا",
            "translation": "Oh Allah! Nothing is easy except what You have made easy.",
            "transliteration": "ALLAHUMMA LA SAHLA ILLAMA JA-‘ALTAHU SAHLA",
            "audio": null
        },
        {
            "id": 6,
            "text": "تَجْعَلُ الْحَزَنَ إِذَا شِئْتَ سَهْلًا",
            "translation": "If You wish, You can make the difficult easy.",
            "transliteration": "TAJ‘ALU AL HAZANA ETHA MA SHI’TA SAHLA",
            "audio": null
        },
        {
            "id": 7,
            "text": "اللَّهُمَّ إِنِّي أَسْتَوْدِعُكَ مَا قَرَأْتُ وَمَا حَفِظْتُ",
            "translation": "Oh Allah! I entrust You with what I have read and I have studied.",
            "transliteration": "ALLAHUMMA INNI ASTAODI'UKA MA QARA'TU WAMA HAFATH-TU",
            "audio": null
        },
        {
            "id": 8,
            "text": "فَرُدَّهُ إِلَيَّ عِنْدَ حَاجَتِي إِلَيْهِ",
            "translation": "Oh Allah! Bring it back to me when I am in need of it.",
            "transliteration": "FARUDDAHU 'ALLAYA INDA HAJATI ILAYHI",
            "audio": null
        },
        {
            "id": 9,
            "text": "إِنَّكَ عَلَىٰ مَا تَشَاءُ قَدِيرٌ وَأَنْتَ حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
            "translation": "Oh Allah! You do whatever You wish, You are my Availer and Protector and the best of aid.",
            "transliteration": "INNAKA 'ALA MA-TASHA'-U QADEER WA ANTA HASBUNA ALLAH WA NI'MAL WAKEEL",
            "audio": null
        }
    ]
}